Repository: tamlyhoctoipham/book-translation-projects
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: vi

source: It is important to do so not only because interrupting conveys to the witness that the interviewer wants short accounts, but also because questions run the risk of biasing the replies.
vi: Nhưng việc làm này là cần thiết không những vì khi nhân chứng bị ngắt lời, họ sẽ nghĩ rằng người thẩm vấn muốn nghe lời khai ngắn gọn, và hơn nữa câu hỏi có nguy cơ gây ảnh hưởng đến câu trả lời.

source: It is important to have men and women to run programmes as they are able to show men and women working well together and showing respect for one another, something which is especially important for rapists in the group to see.
vi: Điều quan trọng là phải có cả nam và nữ để tiến hành các chương trình vì họ có thể cho thấy đàn ông và phụ nữ có thể cùng làm việc được và thể hiện sự tôn trọng lẫn nhau, điều đặc biệt quan trọng để cho những kẻ hiếp dâm trong nhóm thấy được.

source: It is increasingly acknowledged that participation in such traumatic incidents requires a great deal of support from within the police organization.
vi: Việc tham gia vào những sự cố gây sang chấn như vậy đòi hỏi rất nhiều hỗ trợ từ nội bộ phía cảnh sát đang ngày càng được biết đến rộng rãi .

source: It is interesting to explore the way in which different countries perceive vigilante behaviour, or even what constitutes vigilantism.
vi: Thật thú vị khi khám phá ra cách khác biệt của các nước trong nhận thức hành vi kiểm soát trật tự hay cái cả cái điều cấu thành nên chủ nghĩa tự kiểm soát trật tự.

source: It is likely that some of the current trends in punishment will also be rejected in a few years time.
vi: Có vẻ như là một vài xu hướng hiện đại về hình phạt cũng sẽ bị chối bỏ trong vài năm tới.

source: It is normal to experience some stress and to be upset by devastating incidents, but if these symptoms (such as experiencing flashbacks of the incident, sleep problems, feelings of detachment and disruption to normal life) persist over a long period of time, then an officer may be suffering from post-traumatic stress disorder (PTSD).
vi: Gặp phải căng thẳng và cảm giác bực bội khi trải qua những sự cố nghiêm trọng là điều rất bình thường, nhưng nếu các triệu chứng (như trải qua những hồi tưởng về vụ việc, các vấn đề về giấc ngủ, có cảm giác về sự tách biệt và sự phá vỡ cuộc sống bình thường) vẫn tồn tại trong một khoảng thời gian dài, vậy một sĩ quan có thể đang bị rối loạn stress sau sang chấn (PTSD).

source: It is not surprising that the stress experienced by police officers has become the subject of research, for the policing role requires that they deal with difficult situations and investigations, sometimes in highly dangerous and unpredictable circumstances.
vi: Không có gì đáng ngạc nhiên khi mà sự căng thẳng là một chủ đề cần được nghiên cứu khi chúng ta bàn về cảnh sát. Do yêu cầu của nghề nghiệp, cảnh sát thường xuyên phải đối phó với những tình huống khó khăn, điều tra những vụ án hóc búa, thậm chí đôi khi họ bị mắc kẹt trong những tình thế nguy hiểm không thể lường trước được.

source: It is not surprising, therefore, when you think of the processes (those relating to memory and the retrieval of memory) that are involved in the interview situation, that psychologists have been interested in this area for years.
vi: Do đó, cũng không quá bất ngờ khi bạn nghĩ về quy trình này (chúng liên quan đến ký ức và sự hồi phục của ký ức) bao gồm trong tình huống chất vấn mà các nhà tâm lý học rất quan tâm đến lĩnh vực này trong nhiều năm qua.

source: It is now recognized that psychology is highly relevant to many aspects of life, especially those to do with offenders, prisons, the police, witnesses, and the courts.
vi: Tâm lý học bây giờ đã được công nhận là có mối liên hệ bậc nhất với nhiều khía cạnh của cuộc sống, đặc biệt với những tội phạm, tù nhân, cảnh sát, nhân chứng và tòa án.

source: It is often the case that offenders have problematic issues in many areas of their lives that need resolution in order to aid their desistence from crime.
vi: Trong trường hợp những người phạm tội có nhiều vấn đề trong cuộc sống của họ và họ cần được hỗ trợ để ngăn cản ý định phạm tội.

source: It is possible that stronger associations between characteristics and behaviour would be found were more personality related factors investigated.
vi: Rất có thể, việc tìm ra những liên kết vững chắc hơn giữa đặc điểm và hành vi có được dựa trên việc điều tra từ những yếu tố liên quan đến nhân cách.

source: It is quite likely that partners and families of prisoners will also experience both emotional and social loneliness.
vi: Sự cô độc cảm xúc và cô độc xã hội xảy đến với người bạn đời của tù nhân cũng sẽ xảy đến với người thân của họ.

source: It is quite possible that apprehended offenders differ in the way they commit their offences from offenders who remain at large.
vi: Có khả năng những tội phạm đã bị bắt giữ có khác biệt trong cách gân án của họ so với những tội phạm vẫn đang tự do.

source: It is that state of the case which, after the entire comparison and consideration of all the evidence, leaves the minds of the jurors in that condition that they cannot say they feel an abiding conviction of the truth of the charge.
vi: Đó là trường hợp mà sau khi so sánh và xem xét lại toàn bộ bằng chứng, bỏ qua phán quyết của đoàn bồi thẩm trong tình trạng mà họ không thể nói là họ tin chắc về sự thật của bản án.

source: It is therefore important to bear this in mind when considering the research that has been conducted.
vi: Vì vậy này khi xem xét đến các nghiên cứu vẫn đang được tiến hành chúng ta cần phải ghi nhớ điều này

source: It is therefore quite easy to understand why the prison environment itself can result in prisoners experiencing stress.
vi: Vì vậy cũng khá dễ hiểu tại sao tự môi trường nhà tù đã khiến các tù nhân cảm thấy căng thẳng.

source: It is therefore quite likely that some women prisoners will not only already be suffering from psychological distress prior to incarceration but may also therefore be more vulnerable to negative imprisonment factors.
vi: Cũng chính vì lẽ đó mà nhiều tù nhân nữ đã không chỉ phải chịu đựng về nỗi đâu tâm lý do bị tống giam mà cũng có thể do dễ bị tổn thương bởi các tác nhân tiêu cực của sự giam giữ.

source: It is these criminogenic needs that the treatment programme should address in order to attempt to alter the behaviour of those in attendance.
vi: Những nhu cầu dẫn đến phạm tội của chương trình điều trị nên được bàn đến để nỗ lực thay đổi hành vi của những người tham gia.

source: It is these problems or issues that contribute to the individuals continuing in their pattern of criminal behaviour.
vi: Những vấn đề này góp phần xây dựng một khuôn mẫu điển hình về hành vi phạm tội của các cá nhân.

source: It is this punishment aspect of vigilantism that often hits the headlines, and which is the most common feature of vigilantism in most people’s conception.
vi: Đây chính là sự biểu hiện hình phạt của chủ nghĩa kiểm soát trật tự mà thường được đưa lên các tiêu đề, và là tính năng phổ biến nhất của chủ nghĩa kiểm soát trật tự trong quan niệm của đa số mọi người.

source: It is to the psychological assumptions of case linkage that we now turn.
vi: Điều đó có nghĩa là, hiện tại chúng ta đang hướng đến các giả định tâm lý học của kết nối vụ án.

source: It is very difficult to give a full and complete definition of a sexual offender – examples might include someone who has committed a sexual offence, someone who has been convicted of a sexual offence or someone who has committed a sexual act without the consent of the other person.
vi: Rất khó để có thể định nghĩa đầy đủ và chính xác một tội phạm tình dục - các hình mẫu có thể bao gồm một người đã có hành vi quấy rối tình dục, một người đã bị kết án là quấy rối tình dục hoặc một người thực hiện thành động quấy rối mà không có sự đồng thuận từ người khác.

source: It is very difficult to treat sex offenders effectively if they do not believe that they have done anything wrong, so many of the programmes include work to try and get the offenders to realize/accept this.
vi: Rất khó để điều trị hiệu quả cho tội phạm tình dục nếu họ không chịu tin rằng việc họ đã làm là sao, rất nhiều chương trình bao gồm cả quá trình thử làm cho các tội phạm nhận ra/chấp nhận sự thật này.

source: It is well known that stress impairs social, physical and psychological functioning and can result in errors, accidents and poor judgement.
vi: Nhiều người cũng biết rằng căng thẳng sẽ làm suy giảm chức năng hoạt động xã hội, thể chất, tâm lý và có thể dẫn đến sai sót, tai nạn và sự phán xét nghèo nàn.

source: It may be experienced as feeling of tension, anxiety, irritability, poor concentration or sleeplessness, and can affect relationships with family, friends and colleagues.
vi: Có thể được biểu hiện qua cảm giác căng thẳng, lo âu, dễ cáu gắt, kém tập trung hoặc khó ngủ, và có thể ảnh hưởng đến mối quan hệ với gia đình, bạn bè và đồng nghiệp.

source: It may be that police work is inherently stressful, but that does not necessarily mean that officers will always suffer because of it.
vi: Có thể là do công việc cảnh sát vốn đã, nhưng điều đó không có nghĩa là họ thường xuyên phải chịu đựng.

source: It may come as a surprise to learn that offender profiling is rarely a full-time occupation.
vi: Có thể có nhiều người sẽ ngạc nhiên khi biết rằng việc thiết lập hồ sơ tội phạm hiếm khi nào là một công việc toàn thời gian.

source: It might be thought that the roles and responsibilities of the police are well known and agreed upon, but an independent committee of inquiry into the roles and responsibilities of the police in England and Wales (1996) found that no such consensus actually existed.
vi: Vai trò và trách nhiệm của cảnh sát tưởng như đều được biết đến và được thỏa thuận, tuy nhiên khi một ủy ban độc lập thực hiện điều tra vấn đề này đối với cảnh sát tại Anh và xứ Wales (1996), họ nhận ra rằng sự đồng thuận này không tồn tại.

source: It not only means that offenders are no longer able to offend, it may also deter other people from offending in that way if they know they could be executed, and in some countries (e.g. the USA) it is seen as an element of closure for the victim’s families and follows the ‘eye for an eye’ idea of retributive justice.
vi: Điều này "không chỉ" có nghĩa rằng tội phạm không còn khả năng phạm tội, nó còn có thể góp phần ngăn chặn những người có ý định phạm pháp bởi họ biết họ sẽ bị xử phạt theo cách trên nếu vi phạm, và ở một số quốc gia(như Mỹ) điều này được xem như một nhân tố bí mật cho việc ngăn chặn báo ứng, trả thù của gia đình nạn nhân với người phạm tội.

source: It offers a telephone help line, runs media campaigns, sends out information leaflets, holds public meetings and trains professionals in the prevention of abuse.
vi: Nó cũng cấp đường dây hỗ trợ, chạy các chiến dịch truyền thông, phát tờ rơi thông tin, tổ chức các buổi gặp mặt công cộng và đào tạo các chuyên gia trong việc ngăn chặn lạm dụng.

source: It requires precision and understanding to be stable across situation and time.
vi: Nó đòi hỏi độ chính xác và sự hiểu biết để ổn định trạng thái qua thời gian.

source: It seems that most people hold their own, sometimes strong, views relating to how offenders should be dealt with following conviction for an offence.
vi: Có vẻ như hầu hết mọi người đều có ý kiến riêng về việc phạm nhân nên bị xử lí như thế nào với án phạt họ nhận được.

source: It seems that some sort of monetary compensation for loss was preferable to a physical punishment, and only repeat offenders were punished by having part of their body removed or injured in some manner.
vi: Dường như cách đền bù mất mát bằng tiền bạc này thích hợp hơn so với sự trừng phạt về thể xác và chỉ có những kẻ tái phạm nhiều lần mới bị trừng phạt bằng việc bị cắt rời bộ phận cơ thể hoặc làm cho bị thương theo như một số phong tục.

source: It should be brought home to jurors that there is an even greater danger of the earwitnesses believing themselves to be right and yet, in fact, being mistaken;
vi: Bồi thẩm đoàn cũng nên được cảnh báo về khả năng nhân chứng nghe tin rằng họ đúng khi trong thực tế họ lại sai;

source: It should be noted that there is some controversy about whether self-harming and suicide should be considered as being essentially the same behaviour.
vi: Cần chú ý rằng có vài tranh cãi về việc có nên đồng nhất việc tự làm hại, hành hạ bản thân với việc tự tử .

source: It stands to reason that those who are at a higher risk of reconviction are more likely to be reconvicted.
vi: và do đó cũng có khả năng tái phạm cao hơn.

source: It supports multiagency projects (this includes organizations which work with children such as the police, social services, health and voluntary organizations) and tries to raise awareness of the nature of abuse, change attitudes towards abuse so that people are more willing to talk about it, and change the behaviour of abusers and potential abusers.
vi: Nó ủng hộ những dự án đa chi nhánh ( bao gồm các tổ chức làm việc với trẻ em ví dụ như cảnh sát, dịch vụ xã hội, tỏ chức sức khỏe và tình nguyện) và cố gắng nâng cao nhận thức về bản chất của việc bạo hành, thay đổi thái độ về việc bạo hành để mọi người sẵn sàng nói về nó hơn và thay đổi hành vi của những kẻ lạm dụng và những kẻ có nguy cơ lạm dụng.

source: It therefore aims to address offenders’ attitudes and underlying thought processes that contribute to offending behaviour.
vi: Think First hướng đến việc xác định thái độ và các phương thức tư duy góp phần hình thành hành vi phạm tội của phạm nhân.

source: It took them 15 minutes to hack to death the man they say raped them with impunity for more than a decade.
vi: Trong vòng 15' họ đã chém đến chết gã đàn ông đã hiếp dâm họ nhưng không bị kết tội trong hơn 1 thập niên

source: It was also alleged that several names, faces and addresses were incorrect, and so innocent people were being labelled as paedophiles and then hunted down by angry mobs.
vi: Người ta cũng cho rằng một vài cái tên, khuôn mặt và địa chỉ là không chính xác và vì thế nên nhiều người vô tội đã bị dán nhãn ấu dâm và rồi bị săn đuổi bởi đám đông giận dữ.

source: It was believed that the offender, after time, would associate the (deviant) sexual arousal with the unpleasant effect, which would then stop the offender from thinking these thoughts, and indeed evaluations of this work showed that reoffending rates were reduced.
vi: Người ta từng tin rằng tội phạm, sau một thời gian, sẽ gắn kích thích tình dục (lệch lạc) với những ảnh hưởng không thoải mái, và sau đó sẽ ngưng nghĩ đến những ý định này và thông qua đánh giá, cách này thật sự làm giảm mức độ tái phạm.

source: It was not until the 1970s that research on cognitive processes was included in the treatment of sexual offenders, and combinations of behavioural and cognitive research are often a very subtle and sophisticated mix of activities and approaches.
vi: Đến thập niên 70 thì nghiên cứu trên quá trình nhận thức mới được đưa vào quá trình điều trị cho tội phạm tình dục, và những tổ hợp giữ nghiên cứu hành vi và nhận thức thường là một kết hợp rất tinh vi và phức tạp giữa hành động và phương thức.

source: It was noted above that work has also been conducted on describing patterns of behaviour in sexual offenders.
vi: Như đã đề cập ở trên, nghiên cứu cũng tiến hành mô tả hành vi của tội phạm tình dục.

source: It will also introduce you to the equally fascinating but relatively unpublicized practice of linking crimes, which has at times been considered a type of offender profiling.
vi: Chương hai này cũng sẽ giới thiệu với các bạn hoạt động rất thú vị nhưng hầu như chưa được công khai của việc xâu chuỗi các tội ác, điều mà đôi khi được xem như là một dạng của thiết lập hồ sơ tội phạm.

source: It will cover how offenders are selected for treatment and what that treatment consists of, and will also talk about how effective the treatments are at reducing reoffending.
vi: Đây sẽ bao quá về cách chọn phương pháp điều trị cho các tội phạm và những phương pháp đó gồm có những gì, và cũng sẽ nói về hiệu quả của chúng trong việc giảm trường hợp tái phạm.

source: It will guide you through the criminal justice process and provide a brief overview of how criminal psychologists may contribute their expertise at each stage.
vi: Nó sẽ hướng dẫn bạn thông qua quy trình tố tụng hình sự và cung cấp một cái nhìn tổng quan ngắn gọn về cách thức mà các nhà tâm lý học tội phạm đóng góp ý kiến chuyên môn cho mỗi giai đoạn.

source: It will review the general features of the police role, how this has changed over time and how these changes are reflected in the police image.
vi: Nó đưa ra những nhận xét về vai trò của cảnh sát, đặc tính chung, quá trình thay đổi theo thời gian, những thay đổi đó đã được phản ánh như thế nào qua hình tượng cảnh sát

source: It would be extremely hard to address this criticism due to the ethical difficulties and practicalities surrounding interviewing unapprehended offenders about their criminal histories.
vi: Sẽ vô cùng khó để giải quyết sự chỉ trích này do những khó khăn về mặt đạo đức và tính thực tiễn xung quanh việc phỏng vấn những tội phạm chưa bị bắt giữ về lịch sử phạm tội của họ .

source: It would be naive of us, therefore, to think that lie detection will ever achieve very high accuracy rates.
vi: Chẳng phải chúng ta thật ngây thơ khi nghĩ rằng có thể phát hiện dối trá ở mức độ chính xác cao.

source: It would seem from this explanation that criminal psychology is concerned with investigative (those to do with the police) and court processes.
vi: Lý giải này cho rằng tâm lý học tội phạm có mối quan tâm đặc biệt tới điều tra (khi họ làm việc với cảnh sát) và quá trình xét xử.

source: It would seem therefore that a wider definition of the term is needed.
vi: Do đó cần có một định nghĩa rộng hơn, chính xác hơn dành cho khái niệm này.

source: Its effectiveness seemed to vary depending on the type of crime, with it being most effective for arson.
vi: Tính hiệu quả của nó có vẻ sẽ thay đổi phụ thuộc vào loại hình tội ác, trong đó hiệu quả nhất là đối với các vụ phóng hỏa.

source: Its effectiveness was assessed by comparing the size of the total area over which the offences occurred to the (smaller) size of area beginning to be searched on the basis of the geographical profile.
vi: Tính hiệu quả của nó đã được đánh giá bằng cách so sánh quy mô của toàn bộ khu vực nơi gây án với quy mô (nhỏ hơn) của khu vực bắt đầu được nghiên cứu theo căn cứ của hồ sơ tội phạm theo địa lý.

source: Its recent appearances in the media have certainly raised the profile of criminal psychology and a number of students are keen to work in this area.
vi: Gần đây, thuật ngữ này được xuất hiện trên các phương tiện truyền thông đã thúc đẩy hồ sơ của tâm lý học tội phạm và số lượng học sinh mong muốn làm việc trong lĩnh vực này.

source: John is also very interested in offenders with severe learning disabilities and their understanding of their crimes.
vi: John cũng quan tâm đến các tội phạm và cái nhìn của họ về tội ác họ làm

source: John trained in the field of criminal psychology a number of years ago, completing a postgraduate qualification and working as a criminal psychologist within the secure estate for five years.
vi: John được huấn luyện trong lĩnh vực tâm lý học tội phạm nhiều năm về trước, ông hoàn thành chương trình học với tấm bằng tốt nghiệp và làm việc với tư cách là nhà tâm lý học tội phạm về vấn đề bất động sản trong năm năm.

source: Just as crimes have changed, so too have punishments.
vi: Giống như việc tội ác thay đổi thì sự trừng phạt cũng thế.

source: Just as smokers need to work out what it is about their circumstances that prevent them from giving up cigarettes, it is necessary for offenders and their case managers to assess what circumstances or issues within their lives are likely to be contributing to the continuation of their offending behaviour.
vi: Vì thế những người hút thuốc cần hiểu vì sao hoàn cảnh của họ khiến họ không thể từ bỏ thói quen hút thuốc, những phạm nhân và các nhà quản lý cũng cần đánh giá hoàn cảnh nào hay các vấn đề trong cuộc sống của họ có khả năng góp phần vào việc tiếp diễn các hành vi phạm tội.

source: Just as the 1974 review paper had set the agenda for the following decade of public policy in relation to offender treatment, the findings of the meta-analyses of the 1980s and 1990s breathed new life into the rehabilitative agenda.
vi: Giống như bài phê bình năm 1974 đã chỉ ra những điểm quan trọng trong các chính sách công khai trong thập kỉ tới liên quan đến việc điều trị phạm nhân. bằng chứng trong các bài phân tích tổng hợp những năm 80 và 90 đã thổi một làn gió mới vào quá trình cải tạo.

source: Just as the risk and need principles state that the offenders’ risk and need status should be considered in the design of programmes and the allocation of offenders to them, the responsivity principle states that treatment programmes and the delivery of them should be geared to the offenders’ abilities and learning styles.
vi: Các nguyên tắc nguy cơ và nhu cầu phát biểu rằng rằng đặc điểm về nguy cơ phạm tội và nhu cầu của phạm nhân cần được xem xét khi thiết kế và phân chia phạm nhân vào các chương trình. Tương tự như vậy, nguyên tắc đáp ứng phát biểu rằng các chương trình cần được thiết kế phù hợp với khả năng và phong cách học tập của phạm nhân.

source: Just being imprisoned results in a loss of freedom and a loss of autonomy.
vi: Chỉ riêng việc bị nhốt cũng đã khiến người bị giam giữ cảm thấy mất tự do và khả năng tự quyết định.

source: Language provides enormous possibility for variety and people use this variety creatively, both consciously and unconsciously.
vi: Ngôn ngữ đem lại cho chúng ta một tình trạng khổng lồ về sự đa dạng cũng như những người sử dụng sự đa dạng này một cách sáng tạo, có thể do vô thức mà cũng có thể có ý thức.

source: Language reveals lot about the relationships between people and analysis of it can throw light on, for example, power relationships within a courtroom setting.
vi: Ngôn ngữ hé lộ rất nhiều về những mối quan hệ giữa mọi người và việc phân tích nó cũng có thể làm sáng tỏ nhiều điều, ví dụ như những mối quan hệ quyền lực trong phạm vi bối cảnh phòng xử án.

source: Large-scale research projects are needed.
vi: Thay vào đó, những dự án nghiên cứu quy mô lớn lúc này thực sự rất cần thiết.

source: Later research has demonstrated that when people are hypnotized they may well be more suggestible (e.g. go along with leading or suggestive questions): nowadays police use of hypnosis is relatively rare.
vi: Nghiên cứu sau này đã cho thấy con người dễ bị dẫn dắt hơn trong quá trình bị thôi miên (ví dụ như việc dễ đi theo những câu hỏi mang tính dẫn hay gợi ý): ngày nay cảnh sát rất ít dùng biện pháp này.

source: Latin vocabulary and structures are also found.
vi: Từ điển và cấu trúc tiếng Latin cũng được tìm thấy.

source: Laughed at and abused by the police when they reported being raped by Yadav, the women took the law into their own hands.
vi: Đã từng bị cảnh sát cười chế giễu và sỉ nhục khi tố cáo về việc bị Yadav cưỡng hiếp, những người phụ nữ quyết định sẽ hành xử theo luật của họ.

source: Lawrence Solan charted some of these variations, ranging from ‘actual and substantial doubt’, and ‘not a mere possible doubt’, to ‘not a conjecture or fanciful doubt’ and ‘abiding conviction of guilt’.
vi: Lawrence Solan xếp một số các biến thể khác nhau, từ 'nghi ngờ thực tế và đáng kể', và 'không phải là chỉ có thể nghi ngờ', đến 'không phải là một sự phỏng đoán và nghi ngờ huyền ảo "và" tuân thủ pháp kết án tội lỗi'.

source: Leading questions suggest the desired answer.
vi: Câu hỏi dẫn dắt gợi ý về câu trả lời đang được mong đợi.
